[
	{
		"title": "Found",
		"tags": "",
		"body": "<<nameTag Guards >>\nStop Right There!\n<<nameTag Player >>\nOh no... I have to find a way to go around him.",
		"position": {
			"x": 290,
			"y": 221
		},
		"colorID": 0
	},
	{
		"title": "Start_Prisoner_1",
		"tags": "",
		"body": "<<nameTag Jeff>>\nYou have finally wake up.\n<<nameTag Player>>\nuh... Who am I?\n<<nameTag Jeff >>\nWhat!? You lose your memory?\n<<nameTag Player>>\nI guess so...\n<<nameTag Jeff>>\nsigh... You were the most powerful knight in this world. But You got betrayed by your friend.\n<<nameTag Player>>\nUHHHHH, I... I remember...\n<<nameTag Jeff>>\nI think you should try to escape my friend.\n<<nameTag Player>>\nsure, lets do it!!!",
		"position": {
			"x": 291,
			"y": -35
		},
		"colorID": 0
	},
	{
		"title": "Books",
		"tags": "",
		"body": "<<nameTag Book>>\nIntroduction:\n<<nameTag Book>>\n\"In the heart of the medieval village of Eldershire, where dense forests whisper ancient secrets and rivers sing the songs of yore, lived a young boy with dreams of grandeur and adventure.\"\n<<nameTag Book>>\n\"Born to humble farmers, this boy was instilled with the virtues of hard work and honesty. His days were spent tending to fields, but his heart yearned for the mysteries that lay beyond.\"\n<<nameTag Book>>\n\"At the tender age of 12, fate led him to Sir Reginald, a knight of old, whose dwelling lay on the village's outskirts. The boy, driven by an insatiable curiosity and a yearning for valor, begged Sir Reginald to take him under his wing.\"\n<<nameTag Player>>\nWhere is the rest of the pages?\n",
		"position": {
			"x": 294,
			"y": 473
		},
		"colorID": 0
	},
	{
		"title": "Start_Elizabeth",
		"tags": "",
		"body": "<<nameTag Player>>\nWhere am I? Who are you?\n<<nameTag Elizabeth>>\nYou're in the depths of the castle, imprisoned like many who have crossed the wrong people. My name is Elizabeth. I’ve been down here longer than I care to remember.\n<<nameTag Player>>\nI can’t remember anything. My head... it feels like it's been split open. How did I get here?\n<<nameTag Elizabeth>>\nYou were brought in unconscious. From what little I heard, you were betrayed by someone you trusted. It's a cruel fate, but perhaps not an unchangeable one.\n<<nameTag Player>>\nBetrayed? I don't even know who I am. How do I escape this place?\n<<nameTag Elizabeth>>\nEscape won’t be easy, but I believe you have a gift, one that even you might not realize yet. There are tales of knights with unique abilities, those who could turn their surroundings to their advantage.\n<<nameTag Player>>\nA gift? What kind of gift?\n<<nameTag Elizabeth >>\nYou might discover that some talents lie not in your memory, but in your instincts. \n\nI can’t say for sure. But look around you. The MOUSE might guide you. You might find you have the power to influence them in ways you never thought possible.\n<<nameTag Player>>\nAlright, I’ll keep that in mind. Thank you, Elizabeth.",
		"position": {
			"x": -182,
			"y": 95
		},
		"colorID": 0
	}
]